Revit 2024 API
BuiltInFailures.SketchFailures.LoopIntersect Property
 Lines cannot intersect each other. The highlighted lines currently intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LoopIntersect { get; }
Visual Basic
Public Shared ReadOnly Property LoopIntersect As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LoopIntersect {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace